In [ ]:
## \#13: Konversi nilai numerik ke dalam sejumlah kategori

In [4]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

In [6]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    87
1    84
2    63
3    33
4    27
5     3
6    89
7    48
8    91
9    21

In [ ]:
### Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan `cut()`

In [8]:
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])
df

   usia kelompok_usia
0    87        manula
1    84        manula
2    63        dewasa
3    33        dewasa
4    27        dewasa
5     3          anak
6    89        manula
7    48        dewasa
8    91        manula
9    21        dewasa